In [2]:
import pandas as pd

In [3]:
pd.read_excel(r"C:\Users\Samira\Sumeyra\btk-akademi\excel_document.xlsx")

  Unnamed: 0  Maas   Yas Departman
0       Atıl   100  40.0   Yazılım
1     Zeynep   150  50.0      Satış
2     Mehmet   200  30.0        NaN
3      Ahmet    50  10.0  Pazarlama
4      Atlas   150   NaN     Finans
5      Fatma   200  25.0      Hukuk

In [4]:
### biz normalde pandas ile excel tabloları oluşturabiliyorduk
### Şimdi de kayıtlı bir excel dosyasını çekebiliyoruz

In [8]:
dolu_degerler_dataframe = pd.read_excel(r"C:\Users\Samira\Sumeyra\btk-akademi\excel_document.xlsx")

In [9]:
dolu_degerler_dataframe.dropna()

  Unnamed: 0  Maas   Yas Departman
0       Atıl   100  40.0   Yazılım
1     Zeynep   150  50.0      Satış
3      Ahmet    50  10.0  Pazarlama
5      Fatma   200  25.0      Hukuk

In [10]:
## Gördüğün gibi boş değere sahip satır ve sutünları siler ve bana yeni bir tablo sunar

In [11]:
dolu_degerler_dataframe.to_excel(r"C:\Users\Samira\Sumeyra\btk-akademi\new_excel_document.xlsx")

In [13]:
## read_excel
## to_excel

## Bu iki ifade ile excel dosyasını getirebilir üzerinde excel kullanmak yerine pandas kullanarak kolayca değişiklik yapabiliriz
## to_excel bunu kayıt işlemi yapabilirsin